# Core CLI
brew "bat"
brew "btop"
brew "direnv"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "git-delta"
brew "gitmux"
brew "go"
brew "jq"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "sesh"
brew "starship"
brew "tmux"
brew "zoxide"

# Shell integration
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI terminal and fonts
cask "kitty"
cask "font-meslo-lg-nerd-font"
